const menu = (pushname, prefix, batteryT, prema, checATM, useLevel, useXp, patt,) => {
    return `
┏ ✘🌖 *ꪶ ࣤ𝑫͢𝚲𝑹𝑲᭢᜴⁩ꪶ͢𝑩𝑶𝑻ꫂ* 🌘✘┓
┃•────•─────────•───•
┃     
┣━✘🌖 *Iɴғᴏ Usᴜᴀ́ʀɪᴏ* 🌘✘
┃•────•─────────•───•
┣❲👤❳ꪶ͢Nᴏᴍᴇ: ${pushname}ꫂ
┣❲👤❳ꪶ͢Usᴇʀ: ${prema}ꫂ
┣❲👤❳ꪶ͢Dɪɴʜᴇɪʀᴏ: ${checATM}ꫂ
┣❲👤❳ꪶ͢Lᴇᴠᴇʟ: ${useLevel}ꫂ
┣❲👤❳ꪶ͢Xᴘꫂ: ${useXp}ꫂ
┣❲👤❳ꪶ͢Pᴀᴛᴇɴᴛᴇ: ${patt}ꫂ
┃
┃🌖*║▌│█║▌│ █║│█│║▌║*🌘
┣❲❗❳ ɢʀᴜᴘᴏ ᴏғᴄ ᴅᴏ ʙᴏᴛ: +ɢʀᴜᴘᴏ
┃ 
┃ https://instagram.com/Joaovsr25
┃
┏•─────•「★」•─────•┒   
┃  *_🎼Zueras📲_*
┗•─────•「★」•─────•┚
┣❲❖❳ ${prefix}zuera
┣❲❓❳ = Aʙʀᴇ ᴏ MENU ᴅᴀs Zᴜᴇʀᴀs
┣❲❓❳ = Os ᴄᴏᴍᴀɴᴅᴏs ᴅᴇssᴇ MENU ɴᴀ̃ᴏ ᴜᴛɪʟɪᴢᴀᴍ「+」 
┃
┏•─────•「★」•─────•┒   
┃  *_🎼Dᴏᴡɴʟᴏᴀᴅᴇʀ📲_*
┗•─────•「★」•─────•┚
┣❲❖❳ ${prefix}play
┣❲❓❳ = ʙᴀɪxᴀ ᴍsᴄ ᴅᴏ ʏᴏᴜᴛᴜʙᴇ ᴠ¹ 
┣❲❖❳ ${prefix}playv2
┣❲❓❳ = ʙᴀɪxᴀ ᴍsᴄ ᴅᴏ ʏᴏᴜᴛᴜʙᴇ ᴠ²
┃
┏•─────•「★」•─────•┒   
┃      *_👥Gʀᴜᴘᴏs👥_*
┗•─────•「★」•─────•┚
┣❲❖❳ ${prefix}fechar
┣❲❖❳ ${prefix}abrir
┣❲❖❳ ${prefix}promover @
┣❲❖❳ ${prefix}rebaixar @
┣❲❖❳ ${prefix}mencionar
┣❲❖❳ ${prefix}aviso
┣❲❖❳ ${prefix}online
┃
┏•─────•「★」•─────•┒
┃          🔊Aᴜᴅɪᴏs🎼
┗•─────•「★」•─────•┚
┃
┣❲❖❳ ${prefix}esquilo
┣❲❖❳ ${prefix}monstro
┣❲❖❳ ${prefix}lento
┣❲❖❳ ${prefix}rapido
┃
┏•─────•「★」•─────•┒
┃   🌒 Lᴇᴠᴇʟs/Jᴏɢᴏs xᴘ🌔
┗•─────•「★」•─────•┚
┃
┣❲❖❳ ${prefix}rank
┣❲❓❳ ʀᴀɴᴋ ᴅᴏs ɴɪᴠᴇɪs
┣❲❖❳ ${prefix}level
┣❲❓❳ sᴇᴜ ʟᴇᴠᴇʟ
┣❲❖❳ ${prefix}ttt /300xᴘ
┣❲❖❳ ${prefix}abraço @ /130xᴘ
┣❲❖❳ ${prefix}ppt /200xᴘ
┣❲❖❳ ${prefix}pau /130xᴘ
┣❲❖❳ ${prefix}casal @ @ /130xᴘ
┣❲❖❳ ${prefix}eu /130xᴘ
┣❲❖❳ ${prefix}sn /130xᴘ
┣❲❖❳ ${prefix}amongus @ /130xᴘ
┣❲❖❳ ${prefix}comer @ /130xᴘ
┣❲❖❳ ${prefix}pagar @ /10)30xᴘ
┣❲❖❳ ${prefix}matar @ /130xᴘ
┣❲❖❳ ${prefix}adotar @ /130xᴘ
┣❲❖❳ ${prefix}casar @ /130xᴘ
┣❲❖❳ ${prefix}escravizar @ /130xᴘ
┃
┏•─────•「★」•─────•┒
┃  *_🎲 Dɪᴠᴇʀsᴀ̃ᴏ 🎲_*
┗•─────•「★」•─────•┚
┃
┣❲❖❳ ${prefix}img (ᵀᵉˣᵗᵒ)
┣❲❖❳ ${prefix}nomeninja sᴇᴜɴᴏᴍᴇ
┣❲❖❳ ${prefix}gado
┣❲❖❳ ${prefix}chance ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}gay
┣❲❖❳ ${prefix}cassino
┣❲❖❳ ${prefix}omais ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}top5 ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}casal @ @
┣❲❖❳ ${prefix}abraço @
┃
┏•─────•「★」•─────•┒
┃      🏆*_ Rᴀɴᴋs_*🏆
┗•─────•「★」•─────•┚
┣❲❖❳ ${prefix}ranklindos
┣❲❖❳ ${prefix}rankfeios
┣❲❖❳ ${prefix}rankgays
┣❲❖❳ ${prefix}rankcornos
┣❲❖❳ ${prefix}rankburros
┣❲❖❳ ${prefix}rankvirgem    
┃
┏•─────•「★」•─────•┒
│  *_🔧 Fᴇʀʀᴀᴍᴇɴᴛᴀs 🔧_* 
┗•─────•「★」•─────•┚
┃
┣❲❖❳ ${prefix}st
┣❲❓❳ ᴄʀɪᴀ ғɪɢᴜʀɪɴʜᴀs ᴘᴇǫᴜᴇɴᴀs
┣❲❖❳ ${prefix}st2
┣❲❓❳ ᴄʀɪᴀ ғɪɢᴜʀɪɴʜᴀs ɢʀᴀɴᴅᴇs
┣❲❖❳ ${prefix}toimg
┣❲❖❳ ${prefix}tts pt ᵀᵉˣᵗᵒ
┣❲❖❳ ${prefix}wame
┣❲❖❳ ${prefix}ocr
┣❲❖❳ ${prefix}togif
┃
┏•─────•「★」•─────•┒
┃           🖼️Iᴍᴀɢᴇɴs🖼️
┗•─────•「★」•─────•┚
┃
┣❲❖❳ ${prefix}placayt ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}texto3d ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}folhas ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}freefire ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}break ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}cemiterio ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}chama ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}wolf ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}grafite ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}matrix ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}bneon ᴛᴇxᴛᴏ
┣❲❖❳ ${prefix}luzdeneon ᴛxᴛ
┣❲❖❳ ${prefix}gtav
┣❲❖❳ ${prefix}trigger ᴍᴀʀǫᴜᴇ ɪᴍɢ
┣❲❖❳ ${prefix}bf4 ᴛxᴛ/ᴛxᴛ
┣❲❖❳ ${prefix}wolflogo ᴛxᴛ/ᴛxᴛ
┣❲❖❳ ${prefix}marvel ᴛxᴛ/ᴛxᴛ
┣❲❖❳ ${prefix}glitch ᴛxᴛ/ᴛxᴛ
┣❲❖❳ ${prefix}phlogo ᴛxᴛ/ᴛxᴛ
┣❲❖❳ ${prefix}missing ᴛxᴛ/ᴛxᴛ/ᴛxᴛ
┃
┗━━━━━━━━━━━━━━┈`
}
exports.menu = menu

const grupo = (prefix) => {
    return `
┏•─────•「★」•─────•┒   
┃❗*_ɢʀᴜᴘᴏ ᴏғɪᴄɪᴀʟ_*❗
┗•─────•「★」•─────•┚
┃https://chat.whatsapp.com/L3IhomsXPsn0CWcFmEwHa0 
┃Cσℓα αɛ ρɛssᴏᴀʟ ➠✅ ⇡
┗ ┛━━━━━━━━━━━━━━┈`
   }
exports.grupo= grupo

const menujv = (pushname, prefix, waa_version, temporizador, uptime, hr, tanggal, groupName, users, chatss, prema, checATM, useLevel, useXp, requireXp, patt, comandost) => {
    return `
┏ ✘「 ꪶ ࣤ𝑫͢𝚲𝑹𝑲᭢᜴⁩ꪶ͢𝑩𝑶𝑻ꫂ 」✘┓
┃─────────────────
┣❲❖❳ ⁿⁱᶜᵏƲsʋαʀισ: ${pushname}
┣❲❖❳ ᴘʀᴇғɪxᴏ:「+」
┣❲❖❳ ᴄᴏᴍᴀɴᴅᴏs:「+ᴍᴇɴᴜ」
┣❲❖❳ ᴠᴇʀsᴀ̃ᴏ ᴡᴀ: ${waa_version}
┣❲❖❳ ᴛᴇᴍᴘᴏ ᴏɴʟɪɴᴇ: ${temporizador(uptime)}
┣❲❖❳ ᴍᴇᴍᴏʀɪᴀ ʀᴀᴍ: ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
┣❲❖❳ Ǥʀʋρσ: ${groupName}
┣❲❖❳ Ħσʀᴀ́ʀισ: ${hr}
┣❲❖❳ Ɖαтα: ${tanggal}
┣❲❖❳ sтαтʋs: ᴏɴ✅
┣❲❖❳ Ƭσтαℓ ∂ɛ Cнαтs: ${chatss}ᶜʰᵃᵗˢ
┣❲❖❳ ᴛɪᴘᴏ ᴅᴇ ᴜsᴜᴀ́ʀɪᴏ: ${prema}
┣❲❖❳ ᴛᴏᴛᴀʟ ᴅᴇ ᴜsᴜᴀʀɪᴏs: ${users}
┣❲❖❳ ᴄᴏᴍᴀɴᴅᴏs ᴜsᴀᴅᴏs: ${comandost}
┣❲❖❳ ғᴀʟᴀʀ ᴄᴏᴍ ᴅᴏɴᴏ: +ᴅᴏɴᴏ ᵗᵉˣᵗᵒ
┗ ┛━━━━━━━━━━━━━━┈`
}
exports.menujv = menujv

const pz = (pushname, prefix, groupName) => {
    return `
┏ ✘「 ꪶ ࣤ𝑫͢𝚲𝑹𝑲᭢᜴⁩ꪶ͢𝑩𝑶𝑻ꫂ 」✘┓
┃─────────────────
┏•─────•「★」•─────•┒
┃   *_🔞 ʟɪɴᴋs +18 🔞_*
┗•─────•「★」•─────•┚
┣❲❖❳ ⁿⁱᶜᵏƲsʋαʀισ: ${pushname}
┣❲❖❳ ᴘʀᴇғɪxᴏ:「+」
┃─────────────────
┃ϟ➪ www.xvideos.com.br
┃ϟ➪ www.PornHub.com
┃ϟ➪ https://www.sambaporno.com
┃ϟ➪ https://www.redtube.com.br
┃ϟ➪ https://pt.xhamster.com
┃ϟ➪ https://www.xnxx.com
┃ϟ➪ https://www.boafoda.com
┃ϟ➪ https://beeg.com
┃ϟ➪ https://daftsex.com
┃ϟ➪ https://www.eporner.com
┃ϟ➪ https://xvideosporno.blog.br
┗━━━━━━━━━━━━━━┈`
}
exports.pz = pz

const menuvip = (pushname, prefix, groupName) => {
	return `
┏━─────👑────━┓
┃🌒ꪶ ࣤꝒ℟Ʃ𐌼ί𝚄Ɱ᭢᜴⁩ 🌔┃
┗━────╮     ╭───━┛
┏━────╯     ╰──────━┓
┃★彡ᴍᴇɴᴜ ᴅᴏs ᴠɪᴘsミ★
┃ϟ🅥🅘🅟🅢™: ❲ 10 ❳
┃ϟƓʀʯрσ: ${groupName}
┗━─────────╮    ╭──━┛
┏━─────────╯    ╰──━┓
┣❲❖❳ ${prefix}play
┣❲❓❳ ʙᴀɪxᴀ ᴍᴜsɪᴄᴀ ᴅᴏ ʏᴛ
┣❲❖❳ ${prefix}apagar         
┣❲❓❳ ᴀᴘᴀɢᴀ ᴍsɢ ᴅᴏ ʙᴏᴛ
┣❲❖❳ ${prefix}marcar          
┣❲❓❳ ᴍᴀʀᴄᴀ ᴛᴏᴅᴏs ᴅᴏ ɢʀᴜᴘᴏ
┣❲❖❳ ${prefix}tapa @           
┣❲❓❳ ᴛᴀᴘᴀ ɴᴀ ʀᴀʙᴀ ᴅᴇ ᴀʟɢᴜᴇᴍ
┣❲❖❳ ${prefix}banir
┣❲❓❳ ᴘʀᴏɪʙᴇ ᴅᴇ ᴜsᴀʀ ᴏ ʙᴏᴛ
┣❲❖❳ ${prefix}desbanir
┣❲❓❳ ᴅᴇsʙᴀɴᴇ, ʟɪʙᴇʀᴀ
┣❲❖❳ ${prefix}online        
┣❲❓❳ ʟɪsᴛᴀ ᴍᴇᴍʙʀᴏs ᴏɴʟɪɴᴇ
┣❲❖❳ ${prefix}bateria        
┣❲❓❳ ʙᴀᴛᴇʀɪᴀ ᴅᴏ ʙᴏᴛ
┗━━━「 ꪶ ࣤꝒ℟Ʃ𐌼ί𝚄Ɱ᭢᜴⁩━━┛`
}
exports.menuvip = menuvip

const money = (pushname, prefix, checATM2) => {
	return `
┏ ✘🌖 *ꪶ ࣤ𝑫͢𝚲𝑹𝑲᭢᜴⁩ꪶ͢𝑩𝑶𝑻ꫂ* 🌘✘┓
┃•────•─────────•───•
┃ꪶ͢Dɪɴʜᴇɪʀᴏ: ${checATM2}ꫂ
┗━━━━━━━━━━━━━━━━━•`
	}
exports.money = money

const zuera = (pushname, prefix) => {
	return `
┏ ✘🌖 *ꪶ ࣤ𝑫͢𝚲𝑹𝑲᭢᜴⁩ꪶ͢𝑩𝑶𝑻ꫂ* 🌘✘┓
┃•────•─────────•───•
┃     
┣━✘🌖 *Cᴏᴍᴀɴᴅᴏs Lɪᴠʀᴇs* 🌘✘
┃•────•─────────•───•
┣❲❖❳ Acerto mizeravi
┣❲❖❳ Acerto mizeravi
┣❲❖❳ Aham sei
┣❲❖❳ Va a merda
┣❲❖❳ Ai meu cu
┣❲❖❳ Que burro
┣❲❖❳ Chega
┣❲❖❳ Dirigindo
┣❲❖❳ As vezes não
┣❲❖❳ Elemento
┣❲❖❳ Errou
┣❲❖❳ Cada coisa
┣❲❖❳ Zzz
┣❲❖❳ Sou uma foca
┣❲❖❳ Fudeu
┣❲❖❳ Fui tapeado
┣❲❖❳ Miniboi
┣❲❖❳ Iluminati
┣❲❖❳ Vc
┣❲❖❳ Deepweb
┣❲❖❳ Sad
┣❲❖❳ Sadd
┣❲❖❳ O gás
┣❲❖❳ Para
┣❲❖❳ Que bonito
┣❲❖❳ Dollynho
┣❲❖❳ Vergonha
┣❲❖❳ Um merda
┣❲❖❳ Pegano fogo
┣❲❖❳ Vem tranquilo
┃
┗━━━「 ꪶZᑗᙍᖇᗅS᭢᜴⁩━•`
	}
exports.zuera = zuera